In [169]:
import pandas as pd
import numpy as np

In [2]:
firm_name={"03":"IBK기업은행", "11":"NH농협은행", "20":"우리은행",
"23":"SC제일은행","48":"새마을금고", "72":"우체국"}

In [3]:
df = pd.DataFrame.from_dict(firm_name, orient='index', columns = ['FIRM_NAME'])

In [5]:
df

   FIRM_NAME
03   IBK기업은행
11    NH농협은행
20      우리은행
23    SC제일은행
48     새마을금고
72       우체국

In [36]:
df = pd.read_csv('msg_code', names=['MSG_CODE', 'MSG_NAME'], dtype=str)

In [37]:
df

   MSG_CODE       MSG_NAME
0      0100         MS승인요청
1      0110         MS승인응답
2      0300    BC통합IC승인 요청
3      0310    BC통합IC승인 응답
4      0420      MS승인취소 요청
5      0430      MS승인취소 응답
6      9300     NONBC승인 요청
7      9310     NONBC승인 응답
8      0400  BC통합IC승인취소 요청
9      0410  BC통합IC승인취소 응답
10     0200       현금서비스 요청
11     0210       현금서비스 응답

In [38]:
df.head(8)

  MSG_CODE     MSG_NAME
0     0100       MS승인요청
1     0110       MS승인응답
2     0300  BC통합IC승인 요청
3     0310  BC통합IC승인 응답
4     0420    MS승인취소 요청
5     0430    MS승인취소 응답
6     9300   NONBC승인 요청
7     9310   NONBC승인 응답

In [39]:
df.tail()

   MSG_CODE       MSG_NAME
7      9310     NONBC승인 응답
8      0400  BC통합IC승인취소 요청
9      0410  BC통합IC승인취소 응답
10     0200       현금서비스 요청
11     0210       현금서비스 응답

In [40]:
df = df.set_index('MSG_CODE')

In [41]:
df

               MSG_NAME
MSG_CODE
0100             MS승인요청
0110             MS승인응답
0300        BC통합IC승인 요청
0310        BC통합IC승인 응답
0420          MS승인취소 요청
0430          MS승인취소 응답
9300         NONBC승인 요청
9310         NONBC승인 응답
0400      BC통합IC승인취소 요청
0410      BC통합IC승인취소 응답
0200           현금서비스 요청
0210           현금서비스 응답

In [56]:
df = pd.read_csv('msg_code', names=['MSG_CODE', 'MSG_NAME'], dtype=str)
df['COUNT'] = [ np.random.randint(1,500) for i in range(len(df.index)) ]

In [58]:
df

   MSG_CODE       MSG_NAME  COUNT
0      0100         MS승인요청    455
1      0110         MS승인응답    288
2      0300    BC통합IC승인 요청     63
3      0310    BC통합IC승인 응답     60
4      0420      MS승인취소 요청    297
5      0430      MS승인취소 응답    186
6      9300     NONBC승인 요청    185
7      9310     NONBC승인 응답    267
8      0400  BC통합IC승인취소 요청    141
9      0410  BC통합IC승인취소 응답    258
10     0200       현금서비스 요청     54
11     0210       현금서비스 응답     57

In [64]:
df = pd.DataFrame( np.arange(9).reshape(3,3), index=['r1','r2','r3'], columns=['c1','c2','c3'])

In [65]:
df

    c1  c2  c3
r1   0   1   2
r2   3   4   5
r3   6   7   8

In [66]:
df = pd.DataFrame( np.arange(15).reshape(5,3), index=['r1','r2','r3','r4','r5'], columns=['c1','c2','c3'])

In [67]:
df

    c1  c2  c3
r1   0   1   2
r2   3   4   5
r3   6   7   8
r4   9  10  11
r5  12  13  14

In [68]:
df["c1"]>3

r1    False
r2    False
r3     True
r4     True
r5     True
Name: c1, dtype: bool

In [71]:
df['c3']>5

r1    False
r2    False
r3     True
r4     True
r5     True
Name: c3, dtype: bool

In [78]:
df[df["c3"]>10]

    c1  c2  c3
r4   9  10  11
r5  12  13  14

In [80]:
df = pd.DataFrame(np.arange(12).reshape(3,4), index=['1','2','3'] , columns=['a1','a2', 'a3','a4'])
df1 = df[['a3','a2']]

In [81]:
df1

   a3  a2
1   2   1
2   6   5
3  10   9

In [94]:
df = pd.DataFrame(np.array([100,20000, 50,50000, 90, 50000]).reshape(3,2),
columns=['성능','가격'], index=['BC1','BC2','BC3'])

In [95]:
df

      성능     가격
BC1  100  20000
BC2   50  50000
BC3   90  50000

In [98]:
df.loc['BC1']

성능      100
가격    20000
Name: BC1, dtype: int32

In [97]:
df.loc['BC1','가격']

20000

In [145]:
df = pd.DataFrame(np.array([100,20000, 50,50000, 90, 50000]).reshape(3,2),
columns=['성능','가격'], index=['BC1','BC2','BC3'])
df.loc[(df.성능%50==0),"성능"]

BC1    100
BC2     50
Name: 성능, dtype: int32

In [146]:
df.loc[(df.성능%50==0),"성능"]  = 80

In [147]:
df

     성능     가격
BC1  80  20000
BC2  80  50000
BC3  90  50000

In [148]:
df.sort_values('성능') # default 는 오름차순

     성능     가격
BC1  80  20000
BC2  80  50000
BC3  90  50000

#### 내림차순 정리 ascending= False

In [149]:
df.sort_values('성능', ascending=False)

     성능     가격
BC3  90  50000
BC1  80  20000
BC2  80  50000

In [150]:
df.sum()

성능       250
가격    120000
dtype: int64

In [151]:
df.sum(axis=1) # 각 로우별 합계

BC1    20080
BC2    50080
BC3    50090
dtype: int64

In [152]:
df['ROW_SUM'] = df.sum(axis=1)  # 신규 칼럼 추가

In [153]:
df

     성능     가격  ROW_SUM
BC1  80  20000    20080
BC2  80  50000    50080
BC3  90  50000    50090

In [158]:
df = pd.DataFrame(np.array([100,20000, 50,50000, 90, 50000]).reshape(3,2),
columns=['성능','가격'], index=['BC1','BC2','BC3'])
df['ROW_SUM'] = df.sum(axis=1)  # 신규 칼럼 추가
df.loc['COL_SUM',:] = df.sum() # 신규 로우 추가

In [159]:
df

            성능        가격   ROW_SUM
BC1      100.0   20000.0   20100.0
BC2       50.0   50000.0   50050.0
BC3       90.0   50000.0   50090.0
COL_SUM  240.0  120000.0  120240.0

In [163]:
beg_time = pd.to_datetime('20190624 12:30:05', format='%Y%m%d %H:%M:%S')
beg_time

Timestamp('2019-06-24 12:30:05')

In [164]:
end_time = pd.to_datetime('20190624 14:31:05', format='%Y%m%d %H:%M:%S')
end_time

Timestamp('2019-06-24 14:31:05')

In [162]:
end_time - beg_time

Timedelta('0 days 02:01:00')

In [170]:
pd.date_range('20180101', '20181001', freq='M') # 월별 말일 기준 freq="M"

DatetimeIndex(['2018-01-31', '2018-02-28', '2018-03-31', '2018-04-30',
               '2018-05-31', '2018-06-30', '2018-07-31', '2018-08-31',
               '2018-09-30'],
              dtype='datetime64[ns]', freq='M')

In [171]:
pd.date_range('20180101', '20180901', freq='MS') # 월별 초일 기준 freq="MS"

DatetimeIndex(['2018-01-01', '2018-02-01', '2018-03-01', '2018-04-01',
               '2018-05-01', '2018-06-01', '2018-07-01', '2018-08-01',
               '2018-09-01'],
              dtype='datetime64[ns]', freq='MS')

In [172]:
df= pd.DataFrame(pd.date_range('20180101', '20181001', freq='M') , columns=['DATE1'])

In [173]:
df

       DATE1
0 2018-01-31
1 2018-02-28
2 2018-03-31
3 2018-04-30
4 2018-05-31
5 2018-06-30
6 2018-07-31
7 2018-08-31
8 2018-09-30

In [174]:
df['DATE2']= pd.date_range('20180101', '20180901', freq='MS')

In [175]:
df

       DATE1      DATE2
0 2018-01-31 2018-01-01
1 2018-02-28 2018-02-01
2 2018-03-31 2018-03-01
3 2018-04-30 2018-04-01
4 2018-05-31 2018-05-01
5 2018-06-30 2018-06-01
6 2018-07-31 2018-07-01
7 2018-08-31 2018-08-01
8 2018-09-30 2018-09-01

In [179]:
df["DAYS"] = df['DATE1']-df['DATE2']

In [180]:
df

       DATE1      DATE2    DAYS
0 2018-01-31 2018-01-01 30 days
1 2018-02-28 2018-02-01 27 days
2 2018-03-31 2018-03-01 30 days
3 2018-04-30 2018-04-01 29 days
4 2018-05-31 2018-05-01 30 days
5 2018-06-30 2018-06-01 29 days
6 2018-07-31 2018-07-01 30 days
7 2018-08-31 2018-08-01 30 days
8 2018-09-30 2018-09-01 29 days

In [181]:
import datetime
import pandas as pd
beg_time = datetime.datetime.now() #현재시간 datetime 객체
end_time = datetime.datetime.now() + datetime.timedelta(minutes=5) #5분 이후 datetime 객체
print(pd.date_range(beg_time, end_time, freq='10s')) #10초 간격으로 시간 리스트 구함

DatetimeIndex(['2019-06-24 15:42:27.481871', '2019-06-24 15:42:37.481871',
               '2019-06-24 15:42:47.481871', '2019-06-24 15:42:57.481871',
               '2019-06-24 15:43:07.481871', '2019-06-24 15:43:17.481871',
               '2019-06-24 15:43:27.481871', '2019-06-24 15:43:37.481871',
               '2019-06-24 15:43:47.481871', '2019-06-24 15:43:57.481871',
               '2019-06-24 15:44:07.481871', '2019-06-24 15:44:17.481871',
               '2019-06-24 15:44:27.481871', '2019-06-24 15:44:37.481871',
               '2019-06-24 15:44:47.481871', '2019-06-24 15:44:57.481871',
               '2019-06-24 15:45:07.481871', '2019-06-24 15:45:17.481871',
               '2019-06-24 15:45:27.481871', '2019-06-24 15:45:37.481871',
               '2019-06-24 15:45:47.481871', '2019-06-24 15:45:57.481871',
               '2019-06-24 15:46:07.481871', '2019-06-24 15:46:17.481871',
               '2019-06-24 15:46:27.481871', '2019-06-24 15:46:37.481871',
               '2019-06-24 15:46:47.481871', '2019-06-24 15:46:57.481871',
               '2019-06-24 15:47:07.481871', '2019-06-24 15:47:17.481871',
               '2019-06-24 15:47:27.481871'],
              dtype='datetime64[ns]', freq='10S')

In [182]:
code = {'CODE':['A','B','C','D','E'], 'NAME':['아','비','씨','디','이']}
code2 = {'CODE' :['A','B','C','X','Y'],'VALUE':['1','2','3','4','5']}
tf = pd.DataFrame.from_dict(code)  
vf = pd.DataFrame.from_dict(code2)

In [183]:
tf

  CODE NAME
0    A    아
1    B    비
2    C    씨
3    D    디
4    E    이

In [184]:
vf

  CODE VALUE
0    A     1
1    B     2
2    C     3
3    X     4
4    Y     5

In [185]:
pd.merge(tf, vf)

  CODE NAME VALUE
0    A    아     1
1    B    비     2
2    C    씨     3

In [188]:
rf1 = pd.merge(vf,tf, on=['CODE'], how='inner') # how를 지정하지 않아도 기본 inner로 동작

In [189]:
rf1

  CODE VALUE NAME
0    A     1    아
1    B     2    비
2    C     3    씨

In [190]:
r2 = pd.merge(vf,tf, on=['CODE'], how='left') # how를 지정하지 않아도 기본 left로 동작

In [191]:
r2

  CODE VALUE NAME
0    A     1    아
1    B     2    비
2    C     3    씨
3    X     4  NaN
4    Y     5  NaN

In [192]:
r3 = pd.merge(vf,tf, on=['CODE'], how='right') # how를 지정하지 않아도 기본 right 동작

In [193]:
r3

  CODE VALUE NAME
0    A     1    아
1    B     2    비
2    C     3    씨
3    D   NaN    디
4    E   NaN    이

In [194]:
r4 = pd.merge(vf,tf, on=['CODE'], how='outer') # how를 지정하지 않아도 기본 outer 동작

In [195]:
r4

  CODE VALUE NAME
0    A     1    아
1    B     2    비
2    C     3    씨
3    X     4  NaN
4    Y     5  NaN
5    D   NaN    디
6    E   NaN    이